fixed cloud sync and readme
